{"buildingblocks":[{"id":"511","name":"CSV to API","summary":"Text files that contain comma separate values or CSVs, is one of the quickest ways to convert existing data to an API. Each row of a CSV can be imported and converted to a record in a database, and easily generate a RESTful interface that represents the data stored in the CSV.\nCSV to API can be very messy depending on the quality of the data in the CSV, but can be a quick way to breathe new life i","details":"Text files that contain comma separate values or CSVs, is one of the quickest ways to convert existing data to an API. Each row of a CSV can be imported and converted to a record in a database, and easily generate a RESTful interface that represents the data stored in the CSV.\nCSV to API can be very messy depending on the quality of the data in the CSV, but can be a quick way to breathe new life into old catalogs of data lying around on servers or even desktops. The easiest way to deal with CSV is to import directly into database, than generate API from database, but the process can be done at time of API creation.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-csv.png","width":"100","tags":"CSV,CSV to API","category":"CSV to API","categoryslug":"deployment"},{"id":"512","name":"Database to API","summary":"Database to API is definitely the quickest way to generate an API. If you have valuable data, generally in 2013, it will reside in a Microsoft, MySQL, PostgreSQL or other common database platform.\nConnecting to a database and generate a CRUD, or create, read, updated and delete API on an existing data make sense for a lot of reason. This is the quickest way to open up product catalogs, public dire","details":"Database to API is definitely the quickest way to generate an API. If you have valuable data, generally in 2013, it will reside in a Microsoft, MySQL, PostgreSQL or other common database platform.\nConnecting to a database and generate a CRUD, or create, read, updated and delete API on an existing data make sense for a lot of reason. This is the quickest way to open up product catalogs, public directories, blogs, calendars or any other commonly stored data.\nAPIs are rapidly replace database connections, when bundled with common API management techniques, APIs can allow for much more versatile and secure access that can be made public and shared outside the firewall.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-database.png","width":"75","tags":"Database,Database to API","category":"Database to API","categoryslug":"deployment"},{"id":"513","name":"Framework","summary":"There is no reason to hand-craft an API from scratch these days. There are numerous frameworks out their that are designed for rapidly deploying web APIs.\nDeploying APIs using a framework is only an option when you have the necessary technical and developer talent to be able to understand the setup of environment and follow the design patterns of each framework.\nWhen it comes to planning the deplo","details":"There is no reason to hand-craft an API from scratch these days. There are numerous frameworks out their that are designed for rapidly deploying web APIs.\nDeploying APIs using a framework is only an option when you have the necessary technical and developer talent to be able to understand the setup of environment and follow the design patterns of each framework.\nWhen it comes to planning the deployment of an API using a framework, it is best to select one of the common frameworks written in the preferred language of the available developer and IT resources.\nFrameworks can be used to deploy data APIs from CSVs and databases, content from documents or custom code resources that allow access to more complex objects.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-ladder.png","width":"75","tags":"API-Deployment","category":"Framework","categoryslug":"deployment"},{"id":"514","name":"API Gateway","summary":"API gateways are enterprise quality solutions that are designed to expose API resources. Gateways are meant to provide a complete solution for exposing internal systems and connecting with external platforms.\nAPI gateways are often used to proxy and mediate existing API deployments, but may also provide solutions for connecting to other internal systems like databases, FTP, messaging and other com","details":"API gateways are enterprise quality solutions that are designed to expose API resources. Gateways are meant to provide a complete solution for exposing internal systems and connecting with external platforms.\nAPI gateways are often used to proxy and mediate existing API deployments, but may also provide solutions for connecting to other internal systems like databases, FTP, messaging and other common resources.\nMany public APIs are exposed using frameworks, most enterprise APIs are deployed via API gateways--supporting much larger ideployments.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-proxy.png","width":"125","tags":"API-Design","category":"API Gateway","categoryslug":"deployment"},{"id":"515","name":"API Proxy","summary":"API proxy are common place for taking an existing API interface, running it through an intermediary which allows for translations, transformations and other added services on top of API.\nAn API proxy does not deploy an API, but can take existing resources like SOAP, XML-RPC and transform into more common RESTful APIs with JSON formats.\nProxies provide other functions such as service composition, r","details":"API proxy are common place for taking an existing API interface, running it through an intermediary which allows for translations, transformations and other added services on top of API.\nAn API proxy does not deploy an API, but can take existing resources like SOAP, XML-RPC and transform into more common RESTful APIs with JSON formats.\nProxies provide other functions such as service composition, rate limiting, filtering and securing of API endpoints. API gateways are the preffered approach for the enterprise, and the companies that provide services support larger API deployments.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-proxy.png","width":"125","tags":"API-Deployment","category":"API Proxy","categoryslug":"deployment"},{"id":"516","name":"API Connector","summary":"Contrary to an API proxy, there are API solutions that are proxyless, while just allowing an API to connect or plugin to the advanced API resources.\nWhile proxies work in many situations, allowing APIs to be mediated and transformed into required interfaces, API connectors may be preferred in situations where data should not be routed through proxy machines.\nAPI connector solutions only connect to","details":"Contrary to an API proxy, there are API solutions that are proxyless, while just allowing an API to connect or plugin to the advanced API resources.\nWhile proxies work in many situations, allowing APIs to be mediated and transformed into required interfaces, API connectors may be preferred in situations where data should not be routed through proxy machines.\nAPI connector solutions only connect to existing API implementations are easily integrated with existing API frameworks as well as web servers like Nginx.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-connector","width":"125","tags":"API-Deployment","category":"API Connector","categoryslug":"deployment"},{"id":"517","name":"Hosting","summary":"Hosting is all about where you are going to park your API. Usual deployments are on-premise within your company or data center, in a public cloud like Amazon Web Services or a hybrid of the two.\nMost of the existing service providers in the space support all types of hosting, but some companies, who have the required technical talent host their own API platforms.\nWith HTTP being the transport in w","details":"Hosting is all about where you are going to park your API. Usual deployments are on-premise within your company or data center, in a public cloud like Amazon Web Services or a hybrid of the two.\nMost of the existing service providers in the space support all types of hosting, but some companies, who have the required technical talent host their own API platforms.\nWith HTTP being the transport in which modern web APIs put to use, sharing the same infrastructure as web sites, hosting APIs does not take any additional skills or resources, if you already have a web site or application hosting environment.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-hosting","width":"125","tags":"API-Deployment","category":"Hosting","categoryslug":"deployment"},{"id":"518","name":"API Versioning","summary":"There are many different approaches to managing different version of web APIs. When embarking on API deployment you will have to make a decision about how each endpoint will be versioned and maintained.\nEach API service provider offers versioning solutions, but generally it is handled within the API URI or passed as an HTTP header.\nVersioning is an inevitable part of the API life-cycle and is bett","details":"There are many different approaches to managing different version of web APIs. When embarking on API deployment you will have to make a decision about how each endpoint will be versioned and maintained.\nEach API service provider offers versioning solutions, but generally it is handled within the API URI or passed as an HTTP header.\nVersioning is an inevitable part of the API life-cycle and is better to be integrated by design as opposed to waiting until you are forced to make a evolution in your API interface.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-alarm-clock.png","width":"90","tags":"API-Deployment","category":"API Versioning","categoryslug":"deployment"},{"id":"519","name":"Documentation","summary":"API documentation is an essential building block for all API endpoints. Quality, up to date documentation is essential for on-boarding developers and ensuring they successfully integrate with an API.\nDocument needs to be derived from quality API designs, kept up to date and made accessible to developers via a portal.\nThere are several tools available for automatically generting documentation and e","details":"API documentation is an essential building block for all API endpoints. Quality, up to date documentation is essential for on-boarding developers and ensuring they successfully integrate with an API.\nDocument needs to be derived from quality API designs, kept up to date and made accessible to developers via a portal.\nThere are several tools available for automatically generting documentation and even what is called interactive documentation, that allows for developers to make live calls against an API while exploring the documentation.\nAPI documentation is part of every API deployment.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-documents.png","width":"90","tags":"API-Deployment","category":"Documentation","categoryslug":"deployment"},{"id":"520","name":"Code Samples","summary":"Second to documentation, code samples in a variety of programming languages is essential to a successful API integration. With quality API design, generating samples that can be used across multiple API resources is possible.\nMany of the emerging API service providers and the same tools that generate API documentation from JSON definitions can also auto generate code samples that can be used by de","details":"Second to documentation, code samples in a variety of programming languages is essential to a successful API integration. With quality API design, generating samples that can be used across multiple API resources is possible.\nMany of the emerging API service providers and the same tools that generate API documentation from JSON definitions can also auto generate code samples that can be used by developers.\nGeneration of code samples in a variety of programming languages is a requirement during API deployment.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-code.png","width":"115","tags":"API-Deployment","category":"Code Samples","categoryslug":"deployment"},{"id":"692","name":"Scraping","summary":"Harvesting or scraping of data from an existing website, content or data source. While we all would like content and data sources to be machine readable, sometimes you have just get your hands dirty and scrape it. While I don't support scraping of content in all scenarios, and business sectors, but in the right situations scraping can provide a perfectly acceptable content or data source for deplo","details":"Harvesting or scraping of data from an existing website, content or data source. While we all would like content and data sources to be machine readable, sometimes you have just get your hands dirty and scrape it. While I don't support scraping of content in all scenarios, and business sectors, but in the right situations scraping can provide a perfectly acceptable content or data source for deploying an API.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-scraper.jpg","width":"100","tags":"","category":"Scraping","categoryslug":"deployment"},{"id":"693","name":"Container","summary":"The new virtualization movement, lead by Docket, and support by Amazon, Google, Red Hat, Microsoft, and many more, is providing new ways to package up APIs, and deploy as small, modular, virtualized containers.","details":"The new virtualization movement, lead by Docket, and support by Amazon, Google, Red Hat, Microsoft, and many more, is providing new ways to package up APIs, and deploy as small, modular, virtualized containers.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-shipping-container.png","width":"100","tags":"","category":"Container","categoryslug":"deployment"},{"id":"694","name":"Github","summary":"Github provides a simple, but powerful way to support API deployment, allowing for publsihing of a developer portal, documentation, code libraries, TOS, and all your supporting API business building blocks, that are necessary for API effort. At a minimum Github should be used to manage public code libraries, and engage with API consumers using Github's social features.","details":"Github provides a simple, but powerful way to support API deployment, allowing for publsihing of a developer portal, documentation, code libraries, TOS, and all your supporting API business building blocks, that are necessary for API effort. At a minimum Github should be used to manage public code libraries, and engage with API consumers using Github's social features.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-github.jpg","width":"100","tags":"","category":"Github","categoryslug":"deployment"},{"id":"695","name":"Terms of Use \/ Service","summary":"Terms of Use provide a legal framework for developers to operate within. They set the stage for the business development relationships that will occur within an API ecosystem. TOS should protect the API owners company, assets and brand, but should also provide assurances for developers who are building businesses on top of an API. Make sure an APIs TOS pass insepection with the lawyers, but also s","details":"Terms of Use provide a legal framework for developers to operate within. They set the stage for the business development relationships that will occur within an API ecosystem. TOS should protect the API owners company, assets and brand, but should also provide assurances for developers who are building businesses on top of an API. Make sure an APIs TOS pass insepection with the lawyers, but also strike a healthy balance within the ecosystem and foster innovation.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-terms-conditions.png","width":"100","tags":"","category":"Terms of Use \/ Service","categoryslug":"deployment"}],"published":"08\/28\/2014"}