{"company":[{"id":"125","name":"APIAxle","summary":"ApiAxle is a proxy that sits on your network, in front of your API(s) and manages things that you shouldn't have to, like rate limiting, authentication and caching. It's fast, open and easy to configure. ApiAxle is different to the cloud based services such as Mashery in that it&rsquo;s intended to be installed within your LAN and be managed by you. This means you own your users, you own your data","details":"ApiAxle is a proxy that sits on your network, in front of your API(s) and manages things that you shouldn't have to, like rate limiting, authentication and caching. It's fast, open and easy to configure. ApiAxle is different to the cloud based services such as Mashery in that it&rsquo;s intended to be installed within your LAN and be managed by you. This means you own your users, you own your data and you can more easily manage costs. ApiAxle is open-source. This means you can modify it as much as you like and contribute changes back. Others will do the same and gradually the system will become all the better for it.","website":"http:\/\/apiaxle.com\/","twitter":"https:\/\/twitter.com\/apiaxle","github":"https:\/\/github.com\/apiaxle","blog":"http:\/\/blog.apiaxle.com\/","blogrss":"http:\/\/blog.apiaxle.com\/feed.xml","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/api-axle-logo.png","screenshot":null,"tags":"API Deployment,API Management"},{"id":"90","name":"APISpark","summary":"APISpark is an cloud API platform that lets you create, host, manage and use web APIs. Using the Restlet Framework at its core, APISpark simplifies the web API experience, the time to market, and the overall cost to get started and to scale you APIs. Restlet is a web API platform vendor, pioneer of RESTful web APIs. APISpark serves our customers around the world, providing software to build web AP","details":"APISpark is an cloud API platform that lets you create, host, manage and use web APIs. Using the Restlet Framework at its core, APISpark simplifies the web API experience, the time to market, and the overall cost to get started and to scale you APIs. Restlet is a web API platform vendor, pioneer of RESTful web APIs. APISpark serves our customers around the world, providing software to build web APIs, which includes APISpark, the PaaS version of Restlet. APISpark lets you build and deploy your web APIs, which includes the creation, hosting and management--all in one solution.","website":"http:\/\/apispark.com\/","twitter":"https:\/\/twitter.com\/restlet_org","github":"https:\/\/github.com\/apispark","blog":"http:\/\/blog.restlet.com\/","blogrss":"http:\/\/blog.restlet.com\/feed\/","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/APISpark-Logo.png","screenshot":null,"tags":"API Deployment,API Management,API-Deployment"},{"id":"28","name":"Emergent One","summary":"Emergent One is an API platform that allows you to quickly generate and launch a new API from MySQL or Postegres database connections. After launched a developer portal is providing API registration, documentation, blog and console. Emergent One automatically generates documentation and code samples, and provides access controls, caching and analytics for managing your API.Emergent one is a comple","details":"Emergent One is an API platform that allows you to quickly generate and launch a new API from MySQL or Postegres database connections. After launched a developer portal is providing API registration, documentation, blog and console. Emergent One automatically generates documentation and code samples, and provides access controls, caching and analytics for managing your API.Emergent one is a complete cloud solution for taking existing data and deploying, then managing the APIs without any addition deployment of software.","website":"http:\/\/www.emergentone.com\/","twitter":"https:\/\/twitter.com\/emergent_one","github":"","blog":"http:\/\/www.emergentone.com\/blog\/company\/","blogrss":"","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/emergent-one-logo.png","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/EmergentOne-Screenshot.png","tags":"API Deployment,API Management,API-Deployment"},{"id":"22","name":"Intel® Expressway Service Gateway","summary":"Intel Expressway API Manager, powered by Mashery, helps enterprises to integrate 3rd-party APIs with their own on-prem or cloud based internal data services. This provides enterprise class security, legacy integration, and a more flexible enterprise ready MBaaS platform for the development of mobile applications. In conjunction, the Intel&reg; HTML5 Development Environment addresses development cy","details":"Intel Expressway API Manager, powered by Mashery, helps enterprises to integrate 3rd-party APIs with their own on-prem or cloud based internal data services. This provides enterprise class security, legacy integration, and a more flexible enterprise ready MBaaS platform for the development of mobile applications. In conjunction, the Intel&reg; HTML5 Development Environment addresses development cycle challenges with the Intel&reg; XDK - Cross platform development kit enabling &ldquo;write it once, deploy to many&rdquo; mobile platforms.. Intel's App Dev center is a cloud-based service that packages HTML5 apps for Apple iOS, Google Android, Amazon Kindle, Facebook, and other App Stores. Intel also provides APIs through its Cloud Services Platform, including location-based, identity, commerce, context, and recommendation services.","website":"http:\/\/cloudsecurity.intel.com","twitter":"https:\/\/twitter.com\/IntelAPIGateway","github":"","blog":"http:\/\/blogs.intel.com\/security-gateways\/","blogrss":"http:\/\/blogs.intel.com\/security-gateways\/feed\/rss2\/","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/intel-api-management-logo.png","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/Intel-Screenshot.png","tags":"API Deployment,API Gateway,BaaS,Enterprise,Intel"},{"id":"1361","name":"SlashDB","summary":"SlashDB connects your internal databases and constructs a REST\/HTTP web service, easily making database content accessible by URLs for getting, updating, inserting and deleting in a secure way. SlashDB provides connectors for Microsoft SQL Server, Oracle, MySQL, PostGreSQL, IBM DB2 and Sybase--covering the top 5 databases you will find in the enterprise or small to medium businesses.\nSlashDB autom","details":"SlashDB connects your internal databases and constructs a REST\/HTTP web service, easily making database content accessible by URLs for getting, updating, inserting and deleting in a secure way. SlashDB provides connectors for Microsoft SQL Server, Oracle, MySQL, PostGreSQL, IBM DB2 and Sybase--covering the top 5 databases you will find in the enterprise or small to medium businesses.\nSlashDB automatically turns databases into online resource so their  content becomes accessible to authorized web, mobile and enterprise  applications for reading and writing under standard data formats.  Technically speaking, it makes REST APIs out of relational databases.","website":"http:\/\/www.slashdb.com\/","twitter":"http:\/\/twitter.com\/slash_db","github":"","blog":"","blogrss":"http:\/\/www.slashdb.com\/feed\/","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/slashdb-logo.png","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/ap-evangelist-site\/api\/screenshots\/7335_slashdb.png","tags":"API Management,API-Deployment"},{"id":"21","name":"Vordel","summary":"Vordel API Gateway is a policy enforcement point to authenticate API clients and users against enterprise access management platforms. Vordel adds advanced capabilities such as security token mediation for single sign-on and identity federation. Vordel API Gateway also integrates with fine-grained authorization tools to externalize authorization for new and legacy applications. Vordel offers out-o","details":"Vordel API Gateway is a policy enforcement point to authenticate API clients and users against enterprise access management platforms. Vordel adds advanced capabilities such as security token mediation for single sign-on and identity federation. Vordel API Gateway also integrates with fine-grained authorization tools to externalize authorization for new and legacy applications. Vordel offers out-of-the-box integration with all the leading identity management platforms to provide comprehensive API Security.","website":"http:\/\/www.vordel.com\/","twitter":"https:\/\/twitter.com\/vordel","github":"","blog":"http:\/\/resources.vordel.com\/index.php\/category\/blog\/","blogrss":"view-source:http:\/\/feeds.feedburner.com\/Vordelfeeds?format=xml","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/Vordel-API-Management.png","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/Vordel-Screenshot.png","tags":"API Deployment,API Gateway,API Management,Enterprise,Vordel"},{"id":"1688","name":"Storeplacer","summary":"Storeplacer&trade; is an SaaS commerce platform that provides   developers and retailers with multi-channel commerce tools   to engage, analyze and transact with customers anytime on any digital   device.\nStoreplacer provides developers with a powerful API suite, an scalable database and cloud-based tools to create, manage and embed product content and transactions within any digital touchpoint. D","details":"Storeplacer&trade; is an SaaS commerce platform that provides   developers and retailers with multi-channel commerce tools   to engage, analyze and transact with customers anytime on any digital   device.\nStoreplacer provides developers with a powerful API suite, an scalable database and cloud-based tools to create, manage and embed product content and transactions within any digital touchpoint. Developers can use a single backend to easily create omni-channel commerce experiences across web, mobile, iOS, Android, TV, social networks, blog, videos, email, ads, voice apps or other connected devices.","website":"http:\/\/www.storeplacer.com\/","twitter":"https:\/\/twitter.com\/storeplacer","github":"https:\/\/github.com\/Storeplacer","blog":"http:\/\/www.storeplacer.com\/company\/blog\/","blogrss":"http:\/\/bit.ly\/196jVnp","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/store-placer-logo.jpeg","screenshot":null,"tags":"API Management,API-Deployment,BaaS,E-commerce"},{"id":"1813","name":"Oracle","summary":"Secures service-oriented architecture (SOA) deployments on-premise, across domain boundaries, or in the cloud enabling organizations to securely and rapidly adopt cloud, mobile, and SOA services. Provides a lightweight API gateway for securing and managing APIs. Connects mobile devices to existing enterprise systems. Significantly lowers integration costs, decreases total cost of ownership, and re","details":"Secures service-oriented architecture (SOA) deployments on-premise, across domain boundaries, or in the cloud enabling organizations to securely and rapidly adopt cloud, mobile, and SOA services. Provides a lightweight API gateway for securing and managing APIs. Connects mobile devices to existing enterprise systems. Significantly lowers integration costs, decreases total cost of ownership, and reduces deployment risks. Offers rich integration with many identity and access management platforms. Helps streamline regulatory compliance through authentication, authorization, and audit capabilities.","website":"http:\/\/www.oracle.com\/us\/products\/middleware\/identity-management\/api-gateway\/overview\/index.html","twitter":"https:\/\/twitter.com\/OracleSOA","github":"","blog":"","blogrss":"","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/oracle-logo.jpg","screenshot":null,"tags":"API Deployment,API Gateway,API Management"}],"published":"11\/07\/2013"}